{
  "P4206257": {
    "type": "port",
    "name": "Ship of Harkinian",
    "release": "3-30-2024",
    "version": "8.0.6",
    "icon": "media/icons/P4206257.png",
    "description": "Ship of Harkinian is a port of The Legend of Zelda: Ocarina of Time to modern platforms. This version runs natively on the Nintendo Switch and it built with decompiled source code of the original game. It adds numerous improvements, such as widescreen support, higher frame rates, mod support, and features like randomizers, cheat menus, save-states, mod support, and so much more."
  },
  "P6035059": {
    "type": "port",
    "name": "2Ship2Harkinian",
    "release": "3-30-2024",
    "author": "HarbourMasters",
    "version": "1.1.2",
    "icon": "media/icons/P6035059.png",
    "shortDesc": "2Ship2Harkinian is a port of TLoZ: Majora's Mask to the Nintendo Switch.",
    "description": "2Ship2Harkinian is a port of The Legend of Zelda: Majora’s Mask to modern platforms. This version runs natively on the Nintendo Switch and it built with decompiled source code of the original game. It adds numerous improvements, such as widescreen support, higher frame rates, mod support, and features like randomizers, cheat menus, save-states, mod support, and so much more."
  },
  "P1946048": {
    "type": "port",
    "name": "Fallout 2 CE",
    "release": "8-05-2024",
    "version": "1.1.0",
    "icon": "media/icons/P1946048.png",
    "description": "Fallout 2 Community Edition is a fully working re-implementation of Fallout 2, with the same original gameplay, engine bugfixes, and some quality of life improvements, that works (mostly) hassle-free on multiple platforms."
  },
  "P4513428": {
    "type": "port",
    "name": "Fallout CE",
    "release": "12-24-2024 ",
    "version": "1.0.0",
    "icon": "media/icons/P4513428.png",
    "description": "Fallout Community Edition is a fully working re-implementation of Fallout, with the same original gameplay, engine bugfixes, and some quality of life improvements, that works (mostly) hassle-free on multiple platforms."
  },
  "P8997097": {
    "type": "port",
    "name": "Max Payne",
    "release": "2-24-2021",
    "version": 1,
    "icon": "media/icons/P8997097.png",
    "description": "This is a wrapper/port of the Android version of Max Payne Mobile. It loads the original game binary, patches it and runs it. It’s basically as if we emulate a minimalist Android environment in which we natively run the original Android binary as is. This is probably not entirely stable yet, so expect issues."
  },
  "P6123501": {
    "type": "port",
    "name": "OpenLara",
    "release": "1-08-2021",
    "version": "8.01.21",
    "icon": "media/icons/P6123501.png",
    "description": "Classic Tomb Raider open-source engine"
  },
  "P2085144": {
    "type": "port",
    "name": "OpenRCT2",
    "release": "5-06-2019",
    "version": 1.06,
    "icon": "media/icons/P2085144.png",
    "description": "An open-source re-implementation of RollerCoaster Tycoon 2. A construction and management simulation video game that simulates amusement park management."
  },
  "P7079110": {
    "type": "port",
    "name": "Perfect Dark",
    "release": "5-14-2024",
    "version": "Latest",
    "icon": "media/icons/P7079110.png",
    "description": "work in progress port of n64decomp/perfect_dark to modern platforms"
  },
  "P0610933": {
    "type": "port",
    "name": "Space Cadet Pinball",
    "release": "10-14-2021",
    "version": "1.1.1",
    "icon": "media/icons/P0610933.png",
    "description": "Space Cadet Pinball, originally released with Windows 95 in 1995, is a 3D pinball game. This version is based on a reverse engineering of the original game that was ported to the Nintendo Switch."
  },
  "P7745889": {
    "type": "port",
    "name": "Spaghetti Kart",
    "release": "6-21-2025",
    "version": "1.0.0",
    "icon": "media/icons/P7745889.png",
    "description": "Spaghetti Kart is a port of Mario Kart 64 to the Nintendo Switch. This port has many improvements like widescreen support, increased higher frame-rate, and more."
  },
  "P8653461": {
    "type": "port",
    "name": "Starship",
    "release": "5-24-2025",
    "version": "2.0.0",
    "icon": "media/icons/P8653461.png",
    "description": "Starship is a port of the Nintendo 64 game “Star Fox 64” to the Nintendo Switch. This port features many improvements like widescreen, higher frame-rates, and more."
  },
  "P0530742": {
    "type": "port",
    "name": "Super Mario 64",
    "release": "Unknown",
    "version": "1.0.0",
    "icon": "media/icons/P0530742.png",
    "description": "This port of Super Mario 64 adds a ton of features, proper widescreen, steady 60 FPS, analog camera control, a full cheats menu, and so much more."
  },
  "P5300477": {
    "type": "port",
    "name": "The Simpsons Hit & Run",
    "release": "10-05-2023",
    "version": "0.6.1",
    "icon": "media/icons/P5300477.png",
    "description": "This is a port of The Simpsons Hit & Run to the Nintendo Switch based on the leaked source code. The full game should be playable, including local multiplayer in the bonus game. The port is however still incomplete, so some glitches can be observed and some visual effects are missing compared to the PC version."
  },
  "P2775334": {
    "type": "port",
    "name": "Xash3D FWGS",
    "release": "5-06-2021",
    "version": "Latest",
    "icon": "media/icons/P2775334.png",
    "description": "Xash3D (pronounced [ksɑʂ]) FWGS is a game engine, aimed to provide compatibility with Half-Life Engine and extend it, as well as to give game developers well known workflow."
  }
}
